package net.logvv.raven.common.constant;

/**
 * 
 * 常用的正则表达式<br>
 * 
 * @author fanyaowu
 * @data 2014年7月13日
 * @version 1.0.0
 *
 */
public interface RegexConstant {

	
	// 匹配IP
	String IP_REGEX = "^((25[0-5])|(2[0-4]\\d)|(1\\d\\d)|([1-9]\\d)|\\[1-9])(\\.((25[0-5])|(2[0-4]\\d)|(1\\d\\d)|([1-9]\\d)|\\d)){3}$";
	// 匹配中文字符
	String CHINESE_CHAR_REGEX = "[\u4e00-\u9fa5]";
	
	// 匹配空白行
	String NULL_LINE_REGEX = "\\n\\s*\r";
	
	// 匹配email
	String EMAIL_REGEX = "\\w+([-+.]\\w+)*@\\w+([-.]\\w+)*\\.\\w+([-.]\\w+)*";

	/**
	 * 2016-04 手机号码:
	 * 13[0-9], 14[5,7], 15[0, 1, 2, 3, 5, 6, 7, 8, 9], 17[0, 1, 6, 7, 8], 18[0-9]
	 * 移动号段: 134,135,136,137,138,139,147,150,151,152,157,158,159,170,178,182,183,184,187,188
	 * 联通号段: 130,131,132,145,155,156,170,171,175,176,185,186
	 * 电信号段: 133,149,153,170,173,177,180,181,189
	 */

	// 匹配手机号码，必须是以1开头，长度为11位
	String PHONE_NUMBER_REGEX = "^1(3[0-9]|4[57]|5[0-35-9]|7[0135678]|8[0-9])\\d{8}$";    // "^1\\d{10}$";

	// 移动手机号码
	String CM_PHONE_NUMBER_REGEX = "^1(3[4-9]|4[7]|5[0-27-9]|7[08]|8[2-478])\\d{8}$";

	// 电信手机号码
	String CT_PHONE_NUMBER_REGEX = "^1(3[3]|4[9]|53|7[037]|8[019])\\d{8}$";

	// 联通手机号码
	String CU_PHONE_NUMBER_REGEX = "^1(3[0-2]|4[5]|5[56]|7[0156]|8[56])\\d{8}$";
	
	
}
